In [ ]:
import pandas as pd

In [ ]:
people = {
    'first':['Irzelindo', 'Sherly', 'Leonor', 'Artur'],
    'last':['Salvador', 'Salvador', 'Manhica', 'Sambo'],
    'age':[27, 24, 63, 73]
}

In [ ]:
df = pd.DataFrame(people)

In [6]:
df

       first      last  age
0  Irzelindo  Salvador   27
1     Sherly  Salvador   24
2     Leonor   Manhica   63
3      Artur     Sambo   73

In [ ]:
df[['first', 'age']]

In [ ]:
df.loc[[0], ['first', 'last']]

In [11]:
df.set_index('first', inplace=True)

In [12]:
df

               last  age
first
Irzelindo  Salvador   27
Sherly     Salvador   24
Leonor      Manhica   63
Artur         Sambo   73

In [13]:
df.index

Index(['Irzelindo', 'Sherly', 'Leonor', 'Artur'], dtype='object', name='first')

In [16]:
df.loc['Irzelindo', 'age']

27

In [18]:
df.iloc[0]

last    Salvador
age           27
Name: Irzelindo, dtype: object

In [19]:
df.reset_index(inplace=True)

In [20]:
df

       first      last  age
0  Irzelindo  Salvador   27
1     Sherly  Salvador   24
2     Leonor   Manhica   63
3      Artur     Sambo   73

In [36]:
filt = (df['last'] == 'Salvador') | (df['first'] == 'Irzelindo')

In [37]:
filt

0     True
1     True
2    False
3    False
dtype: bool

In [40]:
df.loc[filt]

    first     last  age
2  Leonor  Manhica   63
3   Artur    Sambo   73

In [41]:
df.columns

Index(['first', 'last', 'age'], dtype='object')

In [42]:
df.columns = ['first_name', 'last_name', 'age']

In [43]:
df

  first_name last_name  age
0  Irzelindo  Salvador   27
1     Sherly  Salvador   24
2     Leonor   Manhica   63
3      Artur     Sambo   73

In [46]:
df.columns = [column.lower() for column in df.columns]

In [47]:
df

  first_name last_name  age
0  Irzelindo  Salvador   27
1     Sherly  Salvador   24
2     Leonor   Manhica   63
3      Artur     Sambo   73

In [48]:
df.rename(columns={'first_name':'first', 'last_name':'last'}, inplace=True)

In [49]:
df

       first      last  age
0  Irzelindo  Salvador   27
1     Sherly  Salvador   24
2     Leonor   Manhica   63
3      Artur     Sambo   73

In [50]:
df.loc[2]

first     Leonor
last     Manhica
age           63
Name: 2, dtype: object

In [52]:
df.loc[2] = ['Leonor', 'Sambo', 63]

In [53]:
df

       first      last  age
0  Irzelindo  Salvador   27
1     Sherly  Salvador   24
2     Leonor     Sambo   63
3      Artur     Sambo   73

In [54]:
df.loc[3] = ['Artur', 'Manhica', 73]

In [55]:
df

       first      last  age
0  Irzelindo  Salvador   27
1     Sherly  Salvador   24
2     Leonor     Sambo   63
3      Artur   Manhica   73

In [58]:
df.loc[1, ['first', 'last']] = ['Judas', 'Escariotes']

In [59]:
df

       first        last  age
0  Irzelindo    Salvador   27
1      Judas  Escariotes   24
2     Leonor       Sambo   63
3      Artur     Manhica   73